OpenDTEF-v1912/tutorials/combustion/fireFoam/LES/simplePMMApanel/0/panelRegion/PMMA
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PMMA;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    panel_top
    {
        type            zeroGradient;
    }
    region0_to_panelRegion_panel
    {
        type            zeroGradient;
    }
    panel_side
    {
        type empty;
    }

}


// ************************************************************************* //
