OpenDTEF-v1912/tutorials/combustion/fireFoam/LES/simplePMMApanel/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    pyrolysis
    {
        active          true;

        pyrolysisModel  reactingOneDim;

        region          panelRegion;

        reactingOneDimCoeffs
        {
            qrHSource       no; //Energy source term due in depht radiation

            filmCoupled     false;

            qrHSource       on;

            minimumDelta    1e-6;

            moveMesh        true;

            useChemistrySolvers false;
        }

        infoOutput      true;
    }

// ************************************************************************* //
